//#region 主要内容

/**
 * 1. 如何为程序添加静态类型信息。
 * 2. TypeScript中的原始类型， 如boolean类型、枚举类型和字面量类型等。
 * 3. 具有特殊性质的顶端类型和尾端类型。
 * 4. 与数组相关的数组类型和元组类型。
 * 5. 与对象相关的对象类型、函数类型、接口和类。
 * 6. 能够命名任意类型的类型别名。
 * 
 * 从本章开始，我们将正式进入TypeScript核心类型系统的介绍。
 * 在接下来的三章中，我们将由浅到深详细地介绍TypeScript中的类型。
 * 类型能够用来为程序中的实体，
 * 如函数、变量以及对象属性等添加静态的约束。
 * TypeScript编译器会在程序运行之前就对代码进行静态类型检查，
 * 这样就能够提前发现程序中是否存在某种行为缺失。
 * 
 * 本章将介绍TypeScript中最常用的基础类型，
 * 在后续章节中要介绍的高级类型大多是由这些基础类型构成的。
 * 在学习了本章的内容后，
 * 我们就能够为TypeScript程序中的大部分代码添加静态类型信息。
 */

//#endregion
