//#region 进阶内容

/**
 * 1. 新增的原始数据类型BigInt。
 * 2. 实用的展开运算符和解构功能。
 * 3. 新引入的可选链运算符和空值合并运算符。
 */

/**
 * 注意：
 * 如果在JavaScript程序中使用了较新的语言特性，
 * 那么这段JavaScript程序必须在支持该语言特性的运行环境中才能运行。
 * 但是，开发者通常无法决定JavaScript程序的实际运行环境，这就可能产生兼容性问题。
 * 
 * TypeScript语言的一大特色就是能够支持JavaScript语言中的新特性而不必过多担心兼容性问题。
 * 开发者可以在TypeScript程序中使用新的JavaScript语言特性，
 * 然后由TypeScript编译器将程序编译成兼容指定ECMAScript规范版本的JavaScript程序。
 * 通过这种方式，开发者既可以在程序中使用新的语言特性，又不必担心程序兼容性问题。
 * 
 * 本章将介绍几个新的有代表性的语言特性。
 * 这些语言特性具有很强的实用性，在实际项目中使用得比较频繁。
 * 我们可以在TypeScript语言中直接使用它们。
 */

//#endregion